## Staging: cognito
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 2 to change, 0 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cognito_user_pool.forms will be updated in-place
  ~ resource "aws_cognito_user_pool" "forms" {
        id                         = "ca-central-1_Cguq9JNQ1"
        name                       = "forms_user_pool"
        tags                       = {}
        # (12 unchanged attributes hidden)

      ~ lambda_config {
          + pre_sign_up = (known after apply)
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # aws_lambda_function.cognito_email_sender will be updated in-place
  ~ resource "aws_lambda_function" "cognito_email_sender" {
        id                             = "Cognito_Email_Sender"
      ~ last_modified                  = "2023-05-24T19:25:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "PMktRgvQMBCrirmATRa3pyXeVC3XumLVF2J3hCEZxL4=" -> "va/31Rf8nXt+0K1vY5gwwbnGxpr7VLnnImmdDOpnPDE="
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.cognito_pre_sign_up will be created
  + resource "aws_lambda_function" "cognito_pre_sign_up" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "/tmp/pre_sign_up_main.zip"
      + function_name                  = "Cognito_Pre_Sign_Up"
      + handler                        = "pre_sign_up.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::687401027353:role/iam_for_cognito_lambda"
      + runtime                        = "nodejs16.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "QTDI90Q+x/QfDnbowk26CzT+EGf4lzBQCRoJniGB88s="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + tracing_config {
          + mode = "PassThrough"
        }
    }

  # aws_lambda_permission.allow_cognito_to_call_cognito_pre_sign_up_lambda will be created
  + resource "aws_lambda_permission" "allow_cognito_to_call_cognito_pre_sign_up_lambda" {
      + action        = "lambda:InvokeFunction"
      + function_name = "Cognito_Pre_Sign_Up"
      + id            = (known after apply)
      + principal     = "cognito-idp.amazonaws.com"
      + source_arn    = "arn:aws:cognito-idp:ca-central-1:687401027353:userpool/ca-central-1_Cguq9JNQ1"
      + statement_id  = (known after apply)
    }

Plan: 2 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cognito_user_pool.forms"]

18 tests, 17 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
